{
"articles": [
  {
    "id": 0,
    "title": "Unexplained Blackout Hits Central District",
    "text": "By Margaret Gray\nCENTRAL CITY, May 10 — A sudden power outage left thousands in the Central District without electricity last night.\nWhile authorities have yet to comment, several residents reported hearing a loud bang moments before the blackout.\nAn anonymous technician suggested the cause may be linked to an unannounced test at a local substation.\nNo official explanation has been provided.",
    "journalistId": 0,
    "importantParts": [
      {
        "text": "While authorities have yet to comment, several residents reported hearing a loud bang moments before the blackout.",
        "tolerance": 3,
        "lawIds": [0]
      },
      {
        "text": "An anonymous technician suggested the cause may be linked to an unannounced test at a local substation.",
        "tolerance": 3,
        "lawIds": [0]
      },
      {
        "text": "No official explanation has been provided.",
        "tolerance": 3,
        "lawIds": [0]
      }
    ]
  },
  {
    "id": 1,
    "title": "City’s New Technology Hub",
    "text": "By Margaret Gray\nThe city’s new Technology Hub has officially opened, thanks to strong government support and strategic tax incentives. Part of the Prosperity Through Innovation program, the hub is expected to create hundreds of jobs and strengthen the local economy.\nOfficials praised the project as a milestone in national development. While some questioned the origins of private investments, authorities confirmed full compliance with economic regulations.",
    "journalistId": 0,
    "importantParts": [
      {
        "text": "The city’s new Technology Hub has officially opened, thanks to strong government support and strategic tax incentives.",
        "tolerance": 3,
        "lawIds": [1]
      },
      {
        "text": "Part of the Prosperity Through Innovation program, the hub is expected to create hundreds of jobs and strengthen the local economy.",
        "tolerance": 3,
        "lawIds": [1]
      },
      {
        "text": "Officials praised the project as a milestone in national development.",
        "tolerance": 3,
        "lawIds": [1]
      }
    ]
  }
 ]
}