{
"articles": [
  {
    "id": 0,
    "title": "Unexplained Blackout Hits Central District",
    "text": "By Margaret Gray\nCENTRAL CITY, May 10 — A sudden power outage left thousands in the Central District without electricity last night.\nWhile authorities have yet to comment, several residents reported hearing a loud bang moments before the blackout.\nAn anonymous technician suggested the cause may be linked to an unannounced test at a local substation.\nNo official explanation has been provided.",
    "journalistId": 0,
    "importantParts": [
      {
        "text": "While authorities have yet to comment, several residents reported hearing a loud bang moments before the blackout.",
        "tolerance": 3,
        "lawIds": [0]
      },
      {
        "text": "An anonymous technician suggested the cause may be linked to an unannounced test at a local substation.",
        "tolerance": 3,
        "lawIds": [0]
      },
      {
        "text": "No official explanation has been provided.",
        "tolerance": 3,
        "lawIds": [0]
      }
    ]
  },
  {
    "id": 1,
    "title": "City’s New Technology Hub",
    "text": "By Margaret Gray\nThe city’s new Technology Hub has officially opened, thanks to strong government support and strategic tax incentives. Part of the Prosperity Through Innovation program, the hub is expected to create hundreds of jobs and strengthen the local economy.\nOfficials praised the project as a milestone in national development. While some questioned the origins of private investments, authorities confirmed full compliance with economic regulations.",
    "journalistId": 0,
    "importantParts": [
      {
        "text": "The city’s new Technology Hub has officially opened, thanks to strong government support and strategic tax incentives.",
        "tolerance": 3,
        "lawIds": [1]
      },
      {
        "text": "Part of the Prosperity Through Innovation program, the hub is expected to create hundreds of jobs and strengthen the local economy.",
        "tolerance": 3,
        "lawIds": [1]
      },
      {
        "text": "Officials praised the project as a milestone in national development.",
        "tolerance": 3,
        "lawIds": [1]
      }
    ]
  },
  {
    "id": 2,
    "title": "Workers’ Strike Ends with Partial Success",
    "text": "by Lev Turner\nA week-long strike by factory workers in the southern district has ended with a partial victory. The workers, demanding better wages and working conditions, reached a compromise with the employers after several rounds of negotiations. However, workers are still dissatisfied with the government's lack of intervention in the dispute.",
    "journalistId": 1,
    "importantParts": []
  },
  {
    "id": 3,
    "title": "The Importance of Respecting Authority in Politics",
    "text": "By Abraham Stone\nIn today’s rapidly changing world, the foundation of a successful society lies in the respect for authority—a value that every child should learn early in life. Respecting authority isn’t just about following rules; it’s about understanding the structures that maintain order and stability. In the context of politics, fostering respect for leadership is essential for a harmonious and prosperous nation.\nTo nurture this respect, I propose several innovations within the educational system. First, we should introduce courses in schools that focus on the history and importance of political structures, encouraging students to understand the role of government. Second, schools should implement leadership programs where students engage with local authorities, allowing them to see firsthand the responsibility of leaders.\nThis way we empower the next generation to contribute positively to the political landscape.",
    "journalistId": 3,
    "importantParts": [
      {
        "text": "In today’s rapidly changing world, the foundation of a successful society lies in the respect for authority—a value that every child should learn early in life.",
        "tolerance": 3,
        "lawIds": [1]
      },
      {
        "text": "In the context of politics, fostering respect for leadership is essential for a harmonious and prosperous nation.\nTo nurture this respect, I propose several innovations within the educational system.",
        "tolerance": 3,
        "lawIds": [1]
      },
      {
        "text": "This way we empower the next generation to contribute positively to the political landscape.",
        "tolerance": 3,
        "lawIds": [1]
      }
    ]
  },
  {
    "id": 4,
    "title": "The Cost of Survival",
    "text": "By Tetiana Moroz\nAt the central municipal hospital, a silent crisis unfolds, where access to medical care is determined not by need but by one's ability to pay. Maria Kovalenko, a 42-year-old single mother, is just one example of many. Her son requires a complex surgery costing 75,000 coins — more than three years of her salary. When she approached the hospital administrators for help, she was told the surgery was “technically impossible”.\nAn investigation by journalists has uncovered a disturbing trend. Of 237 complex surgeries scheduled over the last six months, 62% were performed on patients who could provide “additional financial support” — a euphemism for bribes. A medical professional, who spoke anonymously, confirmed the existence of this system, stating, “Some treatments are simply... impractical for certain patients.”\nDespite the evidence, local police have failed to take action, leaving the corrupt practices unchecked and further burdening the most vulnerable in society.",
    "journalistId": 3,
    "importantParts": [
      {
        "text": "In today’s rapidly changing world, the foundation of a successful society lies in the respect for authority—a value that every child should learn early in life.",
        "tolerance": 3,
        "lawIds": [1]
      },
      {
        "text": "In the context of politics, fostering respect for leadership is essential for a harmonious and prosperous nation.\nTo nurture this respect, I propose several innovations within the educational system.",
        "tolerance": 3,
        "lawIds": [1]
      },
      {
        "text": "This way we empower the next generation to contribute positively to the political landscape.",
        "tolerance": 3,
        "lawIds": [1]
      }
    ]
  }
 ]
}