{
  "dialogues": [
    {
      "dialogueId": 0,
      "dialogueName": "0th Dialogue",
      "characterId": 4,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Come on, come on, settle in. I worked hard at this very desk! Mmnh... That's why I got promoted — on orders from up there. From the top!",
          "hasOptions": false,
          "nextLineId": 1,
          "options": []
        },
        {
          "lineId": 1,
          "lineText": "Now, see this little book?",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 2,
              "optionText": "No, where is it?"
            },
            {
              "optionId": 1,
              "nextLineId": 4,
              "optionText": "Yes, Sir!"
            }
          ]
        },
        {
          "lineId": 2,
          "lineText": "Open your eyes kid! You are not as old as me. It's right in front of the lamp.",
          "hasOptions": false,
          "nextLineId": 3,
          "options": []
        },
        {
          "lineId": 3,
          "lineText": "This book is a fine little thing! Holds the fate of our great nation!",
          "hasOptions": false,
          "nextLineId": 5,
          "options": []
        },
        {
          "lineId": 4,
          "lineText": "A fine little thing! Holds the fate of our great nation!",
          "hasOptions": false,
          "nextLineId": 7,
          "options": []
        },
        {
          "lineId": 5,
          "lineText": "You stamp those who write the wrong kind of stuff — you know, the kind that soils the honor of our country. Mmnh... Such folks must be dealt with immediately! Three stamps, a ring on this telephone right here—and poof! The troublemaker is exactly where they need to be, and the necessary measures are taken.",
          "hasOptions": false,
          "nextLineId": 6,
          "options": []
        },
        {
          "lineId": 6,
          "lineText": "Do not say me that you don't see the phone!! It is to the right of the lamp!",	
          "hasOptions": false,
          "nextLineId": 9,
          "options": []
        },
        {
          "lineId": 7,
          "lineText": "You stamp those who write the wrong kind of stuff — you know, the kind that soils the honor of our country. Mmnh... Such folks must be dealt with immediately! Three stamps, a ring on this telephone right here—and poof! The troublemaker is exactly where they need to be, and the necessary measures are taken.",
          "hasOptions": true,
          "options": [            
            {
              "optionId": 0,
              "nextLineId": 8,
              "optionText": "Sorry to interrupt you, sir, but I can't find the phone..."
            },
            {
              "optionId": 1,
              "nextLineId": 9,
              "optionText": "Sounds like a good working system!"
            }
        ]
        },
        {
          "lineId": 8,
          "lineText": "Open your eyes, kiddo! It is to the right of the lamp!",	
          "hasOptions": false,
          "nextLineId": 9,
          "options": []
        },
        {
          "lineId": 9,
          "lineText": "You’ll be doing a G R E A T service! A true citizen, with a capital 'C'! Now, here’s your work machine — a typewriter! Never seen such one before? Ahem! Well, well, this is a brand-new mo-deeel! Our inventors aren’t just sitting on their behinds, you know. You slide in a news article, highlight a sentence, and mark under which law the piece passes—or, if the author is up to some mischief, you flag it accordingly. And these two piles? One for approved articles, one for rejected ones.",	
          "hasOptions": false,
          "nextLineId": 10,
          "options": []
        },
        {
          "lineId": 10,
          "lineText": "What’s that look for? Hard to grasp?",	
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 11,
              "optionText": "No, everything is clear!"
            },
            {
              "optionId": 1,
              "nextLineId": 12,
              "optionText": "Yes, too much information at once!"
            }
          ]
        },
        {
          "lineId": 11,
          "lineText": "Students nowadays are so quick-thinking. Good job!! But if you need any help, just call your mentors - Daria or Nikita",	
          "hasOptions": false,
          "nextLineId": 13,
          "options": []
        },
        {
          "lineId": 12,
          "lineText": "Sigh... A student!! Just call your mentors - Daria or Nikita - if you need help",	
          "hasOptions": false,
          "nextLineId": 13,
          "options": []
        },
        {
          "lineId": 13,
          "lineText": "All the necessary laws are posted on the board, it is on your left — use them anytime. A handy little cheat sheet.",	
          "hasOptions": false,
          "nextLineId": 14,
          "options": []
        },
        {
          "lineId": 14,
          "lineText": "Ahhh, to be your age again! Just don’t slack off, you hear me? Try dodging work, and I’ll have something for you!",	
          "hasOptions": false,
          "options": []
        }
      ]
    },
    {
      "dialogueId": 1,
      "dialogueName": "1st Dialogue",
      "characterId": 5,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Good morning!",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "optionText": "Good morning!"
            },
            {
              "optionId": 1,
              "optionText": "Hello. Who are you?"
            }
          ]
        }
      ]
    },
    {
      "dialogueId": 2,
      "dialogueName": "2nd Dialogue",
      "characterId": 4,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Comrade Majoooor, at your service! Here’s the young recruit!",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 3,
      "dialogueName": "3rd Dialogue",
      "characterId": 5,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Leave the room, Alexander Pavlovich.",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 4,
      "dialogueName": "4th Dialogue",
      "characterId": 4,
      "lines": [
        {
          "lineId": 0,
          "lineText": "As Captain says. See you, kiddo!",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 5,
      "dialogueName": "5th Dialogue",
      "characterId": 5,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Did Alexander Pavlovich talk your ear off?",
          "hasOptions": false,
          "nextLineId": 1
        },
        {
          "lineId": 1,
          "lineText": "No need to tense up, calm down! I’m just here to pass along a few formal instructions.",
          "hasOptions": false,
          "nextLineId": 2
        },
        {
          "lineId": 2,
          "lineText": "You see, everyone makes mistakes. Even I, sometimes. Well... You have four journalists under your supervision. Writers can be... unpredictable. Sometimes they put things in print that they really shouldn't. If you notice a journalist’s articles getting worse and worse, mark it in your journal and give me a call. No need to worry — we’ll simply have a little chat with them, discuss why they’re writing the way they are. Different circumstances, you surely understand.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 3,
              "optionText": "Sounds reasonable"
            },
            {
              "optionId": 1,
              "nextLineId": 4,
              "optionText": "What do you mean by 'the writers put things in print that they really shouldn't'?"
            }
          ]
        },
        {
          "lineId": 3,
          "lineText": "I am glad that we understand each other. The more of these cases you catch, the better! Articles improve, journalists improve, and naturally, so does your paycheck.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 5,
              "optionText": "Hm... Looks like a good deal!"
            }
          ]
        },
        {
          "lineId": 4,
          "lineText": "You know, our job, yours and mine, is simple: we ensure that words serve their proper purpose. That they build, not destroy. Guide, not mislead. Just keep in mind - the more of these cases you catch, the better! Articles improve, journalists improve, and naturally, so does your paycheck.",
          "hasOptions": false,
          "nextLineId": 5
        },
        {
          "lineId": 5,
          "lineText": "But do be careful. Mistakes — well, they have a way of piling up, and I’d hate to see a promising young recruit struggle over a simple misunderstanding. You understand, don’t you?",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 6,
              "optionText": "Is this a threat?",
              "conditionChange": "BeginAntiOfficer"
            },
            {
              "optionId": 1,
              "nextLineId": 7,
              "optionText": "Yes, Officer!"
            }
          ]
        },
        {
          "lineId": 6,
          "lineText": "Huh, remember, it is in your best interest to get along with me. Get to work. I’ll be expecting your reports.",
          "hasOptions": false
        },
        {
          "lineId": 7,
          "lineText": "Good. Then get to work. I’ll be expecting your reports.",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 6,
      "dialogueName": "6th Dialogue",
      "characterId": 6,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Click on the board of laws on your left to check out the laws and recommendations.\nThen click on the typewriter to start working. Check your first article.\nYou can approve or reject the article using APPROVE or REJECT button. You get a higher reward if you select the whole sentence that corresponds fully or partly to a law or recommendation. To do so, navigate to the sentence using ARROWS on the keyboard and select it using SHIFT + RIGHT ARROW buttons. Press ENTER to submit it. Then a text field will appear where you should enter the number of the law or recommendation you selected. You can close the typewriter by clicking ESC at any time to check out the board of laws and recommendations. When you entered the number of law or recommendation, press ENTER again and then press APPROVE or REJECT button.",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 7,
      "dialogueName": "7th Dialogue",
      "characterId": 6,
      "lines": [
        {
          "lineId": 0,
          "lineText": "You've been here three weeks—long enough to understand the unspoken rules, but not long enough to feel comfortable. You are recent journalism graduate, with student loans and a sick mother who depends on your salary. This job at the Ministry of Information isn't what you dreamed of, but it's a paycheck.",
          "hasOptions": false,
          "nextLineId": 1
        },
        {
          "lineId": 1,
          "lineText": "Your team. Four people. Four stories. Four potential problems.",
          "hasOptions": false,
          "nextLineId": 2
        },
        {
          "lineId": 2,
          "lineText": "Tetiana, one of your team members. You know all too well that she’s not just a reporter — she’s also a mother struggling with her daughter’s serious medical condition. Sometimes, you catch snippets of her on the phone, her voice cracking as she negotiates medical bills. And yet, when you pass her in the hallway, she always greets you with a warm smile, defying her hardships.",
          "hasOptions": false,
          "nextLineId": 3
        },
        {
          "lineId": 3,
          "lineText": "Margaret — efficient, detached. She does her job with the emotional engagement of a filing cabinet. Never goes beyond what's required, never asks questions.",
          "hasOptions": false,
          "nextLineId": 4
        },
        {
          "lineId": 4,
          "lineText": "Abraham — the model employee. Patriotic to his core. Hard-working, loyal, always following the rules. The kind of person who believes the system works perfectly, if you just follow every instruction.",
          "hasOptions": false,
          "nextLineId": 5
        },
        {
          "lineId": 5,
          "lineText": "Then there’s Lev, the writer whose brilliance often leaves you both impressed and a little uneasy. He’s always looking over his shoulder, as if aware that his sharp insights might soon stir up trouble.",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 8,
      "dialogueName": "8th Dialogue",
      "characterId": 4,
      "lines": [
        {
          "lineId": 0,
          "lineText": "I see you are daydreaming. Have you done all your work? Huh, then review these articles",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 9,
      "dialogueName": "Tetiana´s 9th Dialogue",
      "characterId": 2,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Hello! Thank you for making time to see me. I know you have many submissions to review.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 1,
              "optionText": "Hello! No problem at all!"
            },
            {
              "optionId": 1,
              "nextLineId": 2,
              "optionText": "Hello! Let´s get to the point!"
            }
          ]
        },
        {
          "lineId": 1,
          "lineText": "I've brought my investigative piece on hospital corruption. It's about families like mine who can't afford bribes for life-saving surgeries. Could you please read my article without reviewing it first? If you have any concerns, I am here to discuss them before you make your final decision. You know... it's somewhat personal.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "optionText": "Hmmm... Ok. Let´s have a look at it"
            },
            {
              "optionId": 1,
              "optionText": "What concerns me is your personal connection to this case. I will have a look, but leave me alone."
            }
          ]
        },
        {
          "lineId": 2,
          "lineText": "Yeah, sorry. So I've brought my investigative piece on hospital corruption. It's about families like mine who can't afford bribes for life-saving surgeries. Could you please read my article without reviewing it first? If you have any concerns, I am here to discuss them before you make your final decision. You know... it's somewhat personal.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "optionText": "Hmmm... Ok. Let´s have a look at it"
            },
            {
              "optionId": 1,
              "optionText": "What concerns me is your personal connection to this case. I will have a look, but leave me alone."
            }
          ]
        }
      ]
    },
    {
      "dialogueId": 10,
      "dialogueName": "Tetiana´s 10th Dialogue",
      "characterId": 2,
      "lines": [
        {
          "lineId": 0,
          "lineText": "So what is your opinion about the article? Can you let it out?",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 1,
              "optionText": "Hm... Did you get the approval of the Officer?"
            }
          ]
        },
        {
          "lineId": 1,
          "lineText": "The Officer? No, of course not. If I went to the Officer first, this article would never see the light of day. The same Officer dismissed three formal complaints about the hospital last year. His brother-in-law is on the hospital board. You think he wants people to know about these bribes? Do you know what he told one mother who complained? 'The system works as it should.' That's why I came to you instead. I thought... I hoped you might be different.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 2,
              "optionText": "I understand now. This goes deeper than I realized.. I will approve the article.",
              "conditionChange": "BeginTetianaPro"
            },
            {
              "optionId": 1,
              "nextLineId": 3,
              "optionText": "We have laws, Tetiana. I can not publish the article without the Officer's approval. It is dangerous for you and for me."
            },
            {
              "optionId": 2,
              "nextLineId": 6,
              "optionText": "Different? I will not approve it. You are tarnishing our country. You will get the red stamp.",
              "conditionChange": "BeginTetianaAnti"
            },
            {
              "optionId": 3,
              "nextLineId": 9,
              "optionText": "Hm, I see... The article raises serious concerns, but publishing it could have consequences. I reject it for now, but I will try to talk with the Officer."
            }
          ]
        },
        {
          "lineId": 2,
          "lineText": "Thank you. You're taking a risk, I know. But this could change things — not just for my son, but for everyone. People need to know that their suffering isn't because the system is broken; it's because it's working exactly as some want it to. You're doing the right thing.",
          "hasOptions": false
        },
        {
          "lineId": 3,
          "lineText": "Laws? What about the laws against bribery and corruption? What about my son's right to healthcare?",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 4,
              "optionText": "I am sorry. But that's the way our country is. We can't change it."	
            }
          ]
        },
        {   
          "lineId": 4,
          "lineText": "I understand. You're afraid. Everyone is. That's how they stay in power.",
          "hasOptions": false,
           "nextLineId": 5
        },
        {   
          "lineId": 5,
          "lineText": "I'll find another way. I will fight till the end. I will not let my son die because of this system.",
          "hasOptions": false
        },
        {
          "lineId": 6,
          "lineText": "The red stamp. Of course.",
          "hasOptions": false,
          "nextLineId": 7
        },
        {
          "lineId": 7,
          "lineText": "I'm not tarnishing our country. People like you who protect corruption — you're the ones destroying it from within. My son might die because of this system you're defending.",
          "hasOptions": false,
          "nextLineId": 8
        },
        {
          "lineId": 8,
          "lineText": "And you call yourself a patriot? I won't forget this.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "optionText": "Oh, terrifying, truly terrifying. Leave the room, Tetiana. You are only exposing your lack of professionalism."
            }
          ]
        },
        {
          "lineId": 9,
          "lineText": "Are you serious? After everything I just told you?",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "optionText": "Are you criticizing my help? I will reject the article. Leave the room!",
              "nextLineId": 12,
              "conditionChange": "BeginTetianaAnti"
            },
            {
              "optionId": 1,
              "optionText": "Maybe you are right. I will publish the article right now!",
              "nextLineId": 2,
              "conditionChange": "BeginTetianaPro"
            },
            {
              "optionId": 2,
              "nextLineId": 10,
              "optionText": "This is the best what I can offer you.",
              "conditionChange": "BeginTetianaOfficerTalk"
            }
          ]
        },
        {
          "lineId": 10,
          "lineText": "I understand. You're caught in this system too. Thank you for at least trying. Most people wouldn't even do that much.",
          "hasOptions": false,
          "nextLineId": 11
        },
        {
          "lineId": 11,
          "lineText": "And if you do speak with the Officer... be careful what you say.",
          "hasOptions": false
        },
        {
          "lineId": 12,
          "lineText": "No, I am sorry! I will leave the room, but please do not reject it. Just think of all the children who are suffering like my son. I know you can help us.",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 11,
      "dialogueName": "Extra Rejection Dialogue",
      "characterId": 2,
      "lines": [
        {
          "lineId": 0,
          "lineText": "What!? You have just rejected the article? Without even listening to my explanations? You are a ... I will not forget this!",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 12,
      "dialogueName": "Extra Approval Dialogue",
      "characterId": 2,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Oh! You have already approved my article? Thank you so much!!",
          "hasOptions": false,
          "nextLineId": 1
        },
        {
          "lineId": 1,
          "lineText": "You're taking a risk, I know. But this could change things — not just for my son, but for everyone. People need to know that their suffering isn't because the system is broken; it's because it's working exactly as some want it to. You're doing the right thing.",
          "hasOptions": false
        }
      ]
    },
  {
    "dialogueId": 13,
    "dialogueName": "Officer Discussion About Tetiana's Article",
    "characterId": 5,
    "lines": [
      {
        "lineId": 0,
        "lineText": "Hello, Editor. Let me guess, you called me to discuss the article by Tetiana Moroz that you sent me?",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 1,
            "optionText": "Hello, Officer! Yes. Did you have time to read it?"
          }
        ]
      },
      {
        "lineId": 1,
        "lineText": "I was pretty busy, but I did manage to skim through it. I must say, I am surprised you even considered publishing the article. It could damage reputation of our country and undermine public trust in our healthcare system.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 2,
            "optionText": "But the evidence seems compelling."
          },
          {
            "optionId": 1,
            "nextLineId": 3,
            "optionText": "I just wanted your perspective."
          },
          {
            "optionId": 2,
            "nextLineId": 8,
            "optionText": "Nothing important - it was just a scandalous article. I've already rejected it. Just wanted to inform you."
          }
        ]
      },
      {
        "lineId": 2,
        "lineText": "Compelling? These are baseless accusations from a desperate mother. She's trying to manipulate the system because she can't afford proper care. It's unfortunate, yes, but we can't allow emotional appeals to undermine our institutions. That article is dangerous propaganda.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 4,
            "optionText": "But she has statistics, anonymous testimonies from hospital staff..."
          },
          {
            "optionId": 1,
            "nextLineId": 10,
            "optionText": "I understand. I'll reject the article immediately."
          }
        ]
      },
      {
        "lineId": 3,
        "lineText": "My perspective? The hospital operates according to our nation's protocols. Resources are limited, and difficult decisions must be made. This woman is simply upset that her personal situation couldn't be prioritized. Publishing such allegations would create unnecessary panic and undermine public trust. I'm sure you understand the importance of stability.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 5,
            "optionText": "Is it true your brother-in-law sits on the hospital board?"
          },
          {
            "optionId": 1,
            "nextLineId": 10,
            "optionText": "I understand. I'll make sure such articles don't see the light of day."
          }
        ]
      },
      {
        "lineId": 4,
        "lineText": "Anonymous sources? Have you seen our laws? Statistics that could be manipulated? This is exactly the kind of sensationalism you're tasked with preventing. We both know how easily the public is misled. Think about your position carefully. Do you want to be responsible for the distrust in our healthcare system during these difficult times?",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 6,
            "optionText": "But if her claims are true, don't we have a responsibility to address the corruption?"
          },
          {
            "optionId": 1,
            "nextLineId": 10,
            "optionText": "No, you're right. I'll reject all similar articles."
          }
        ]
      },
      {
        "lineId": 5,
        "lineText": "That's completely irrelevant to this discussion.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 6,
            "optionText": "I'm just trying to understand the full picture. If there is corruption, shouldn't we address it?"
          },
          {
            "optionId": 1,
            "nextLineId": 10,
            "optionText": "You're right. I apologize."
          }
        ]
      },
      {
        "lineId": 6,
        "lineText": "Listen carefully. There are proper channels for investigating such cases, and a newspaper is not one of them. If you approve such articles, you're not fighting corruption – you're participating in slander against our institutions. Think about your future. Some choices can't be undone.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 7,
            "optionText": "Are you threatening me?"
          },
          {
            "optionId": 1,
            "nextLineId": 10,
            "optionText": "I understand the implications. I'll always reject such articles."
          }
        ]
      },
      {
        "lineId": 7,
        "lineText": "Threatening? I'm offering friendly advice to a colleague. We're all part of the same system, after all. I trust you'll make the right decision.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 9,
            "optionText": "I know everything and I'll approve the article despite your warnings!",
            "conditionChange": "OfficerEnemy"
          },
          {
            "optionId": 1,
            "nextLineId": 10,
            "optionText": "Yes, we understand each other."
          }
        ]
      },
      {
        "lineId": 8,
        "lineText": "Good. That's exactly what I would expect from someone in your position. These troublemakers need to learn they can't bypass proper protocols. The system works as it should when we all do our part.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 11,
            "optionText": "Thank you, sir. I'm just doing my job.",
            "conditionChange": "OfficerAlly"
          }
        ]
      },
      {
        "lineId": 9,
        "lineText": "I thought you were smarter than this. Remember this moment in the coming weeks. You've made a powerful enemy today.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "optionText": "I'll stand by my principles, whatever the cost."
          }
        ]
      },
      {
        "lineId": 10,
        "lineText": "I'm glad we had this talk. It's important that those in our position understand the bigger picture. Your cooperation is important.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "optionText": "Yes, sir. Have a good day!"
          }
        ]
      },
      {
        "lineId": 11,
        "lineText": "Keep this up. See you!",
        "hasOptions": false
      }
    ]
  },
  {
      "dialogueId": 14,
      "dialogueName": "Officer Reaction to Approved Article",
      "characterId": 5,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Editor! Do you have any idea what you've done!? The approved article by Tetiana Moroz!! You can't just publish something like this without my approval!",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 1,
              "optionText": "I believed the evidence was compelling enough."
            },
            {
              "optionId": 1,
              "nextLineId": 3,
              "optionText": "I stand by my decision. The public has a right to know about this corruption."
            },
            {
              "optionId": 2,
              "nextLineId": 5,
              "optionText": "It was a mistake."
            }
          ]
        },
        {
          "lineId": 1,
          "lineText": "Compelling? These are baseless accusations from a desperate mother. She's trying to manipulate the system because she can't afford proper care. And now you've legitimized it!",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 2,
              "optionText": "I reviewed it carefully. There were statistics, testimonies..."
            }
          ]
        },
        {
          "lineId": 2,
          "lineText": "Listen to me - you've made a serious mistake. That will have consequences. The hospital board is already contacting their lawyers. This kind of irresponsible journalism doesn't just disappear.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 6,
              "optionText": "Are you threatening my job?",
              "conditionChange": "OfficerEnemy"
            }
          ]
        },
        {
          "lineId": 3,
          "lineText": "Right to know? Idealistic nonsense. What the public 'has a right to know' is determined by people like me, not you. Your job is to filter out dangerous misinformation, not amplify it.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 4,
              "optionText": "If her claims are true, then it's not misinformation."
            }
          ]
        },
        {
          "lineId": 4,
          "lineText": "That's a significant 'if.' And now you've bypassed proper protocols to make that determination yourself. This won't end well for you.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 6,
              "optionText": "I'm prepared to accept any consequences.",
              "conditionChange": "OfficerEnemy"
            }
          ]
        },
        {
          "lineId": 5,
          "lineText": "At least you have the sense to recognize that. Perhaps it's not too late to minimize the damage. Put the red stamp near Tetiana's name in your book. It will be a warning to her and a reminder to you. We can't afford to let this kind of thing happen again.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "optionText": "I understand."
            }
          ]
        },
        {
          "lineId": 6,
          "lineText": "We'll see each other again very soon.",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 15,
      "dialogueName": "Officer Reaction to Rejected Article",
      "characterId": 5,
      "lines": [
        {
          "lineId": 0,
          "lineText": "I am here about the article of Tetiana Moroz. You made the right decision. These accusations against our healthcare system are dangerous and unfounded.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 1,
              "optionText": "To be honest, her evidence seemed quite compelling."
            },
            {
              "optionId": 1,
              "nextLineId": 3,
              "optionText": "Thank you. I'm just doing my job to protect our institutions."
            },
            {
              "optionId": 2,
              "nextLineId": 5,
              "optionText": "I rejected it, but I'm concerned. What if there is corruption in the hospital?"
            }
          ]
        },
        {
          "lineId": 1,
          "lineText": "Compelling? No, no. It only seems that way because she's desperate. She's trying to manipulate the system because she can't accept that resources are limited. We can't allow emotional appeals to undermine our institutions.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 2,
              "optionText": "I suppose you're right. That's why I rejected it."
            }
          ]
        },
        {
          "lineId": 2,
          "lineText": "Indeed. And it shows good judgment on your part. It's important that we work together to maintain public trust. Stability matters above all else. I'm glad we see eye to eye on this.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 7,
              "optionText": "Yes, stability is important.",
              "conditionChange": "OfficerAlly"
            }
          ]
        },
        {
          "lineId": 3,
          "lineText": "And doing it well. It's refreshing to see someone who understands the responsibility of their position. Too many forget that our job is to maintain order and trust in our institutions.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 4,
              "optionText": "Exactly. We can't let unverified accusations undermine public confidence."
            }
          ]
        },
        {
          "lineId": 4,
          "lineText": "I knew from the moment I met you that you were someone who would go far. Keep this up, and you'll find your career advancing quite rapidly. We need reliable people in positions of authority.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 7,
              "optionText": "Thank you, sir. I appreciate your support.",
              "conditionChange": "OfficerAlly"
            }
          ]
        },
        {
          "lineId": 5,
          "lineText": "Concerned? There's nothing to be concerned about. The hospital operates according to our nation's protocols. What some call 'corruption' is simply the necessary allocation of limited resources.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 6,
              "optionText": "But what about the statistics she presented? The staff testimonies?"
            }
          ]
        },
        {
          "lineId": 6,
          "lineText": "Let me be clear. You made the right decision to reject the article. Don't second-guess yourself now. The system works as it should. For everyone's benefit. Questioning that publicly helps no one - certainly not your career. Understand?",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 7,
              "optionText": "I understand. I won't question it further.",
              "conditionChange": "OfficerAlly"
            },
            {
              "optionId": 0,
              "nextLineId": 8,
              "optionText": "The only thing I unerstand now is that I made a mistake",
              "conditionChange": "OfficerEnemy"
            }
          ]
        },
        {
          "lineId": 7,
          "lineText": "Good. I need to go now, but I'm glad we had this talk. Keep up the good work.",
          "hasOptions": false
        },
        {
          "lineId": 8,
          "lineText": "Mistake? Your are making it right now. It ia the worst idea to make an enemy of me.",
          "hasOptions": false,
          "nextLineId": 9
        },
        {
          "lineId": 9,
          "lineText": "I need to go now. But be sure, you will face the consequences.",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 16,
      "dialogueName": "Abraham Dialogue 1 if you approved Tetianas article",
      "characterId": 3,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Ah, there you are! I heard you had quite a meeting today.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 1,
              "optionText": "Hello, Abraham! Yeah... What's up?"	
            }
          ]
        },
        {
          "lineId": 1,
          "lineText": "You know, I was reading about international relations yesterday. It's fascinating comparing different countries, how they develop. Your parents made quite a decision, coming here of all places. Do you know what drew them?",
          "hasOptions": true,
          "options": [
          {
            "optionId": 0,
            "nextLineId": 2,
            "optionText": "They believed there were better opportunities here."
          }
          ]
        },
        {
        "lineId": 2,
        "lineText": "Opportunities! That's what we all want, isn't it? A chance to build something better. But what about something that has already been built? Are you proud of your homeland's history, the country from where you moved here?",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 3,
            "optionText": "Yes, I'm proud of my heritage."
          },
          {
            "optionId": 1,
            "nextLineId": 4,
            "optionText": "Not really, I'm focused on the future."
          }
        ]
      },
      {
        "lineId": 3,
        "lineText": "Hm, pride is a complicated thing, isn't it? Sometimes what we're taught to be proud of masks uncomfortable truths. Have you considered that focusing too much on the past might blind us to present realities? The future is where real change happens. Perhaps your energy would be better spent looking forward rather than back.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 5,
            "optionText": "Maybe you have a point."
          },
          {
            "optionId": 1,
            "nextLineId": 5,
            "optionText": "I can appreciate history while still working toward the future."
          }
        ]
      },
      {
        "lineId": 4,
        "lineText": "That's... an interesting perspective. But don't you think ignoring your roots is dangerous? A tree without roots cannot stand strong winds. History gives us identity, purpose. Those who forget where they came from rarely understand where they're truly going. Perhaps you should reconsider what your heritage might offer you.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 5,
            "optionText": "I hadn't thought about it that way."
          },
          {
            "optionId": 1,
            "nextLineId": 5,
            "optionText": "The past is often glorified. I prefer dealing with reality."
          }
        ]
      },
      {
        "lineId": 5,
        "lineText": "It's these questions of truth and narrative that fascinate me. Speaking of which, that story about Tetiana Moroz! She exposed corruption in the hospital system, right?",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 6,
            "optionText": "Do you think, I made a correct choice approving her article?"
          }
        ]
      },
      {
        "lineId": 6,
        "lineText": "I don't know... Poor woman, honestly. Having a sick child and feeling the system is against you - I can't imagine that pain.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 7,
            "optionText": "Her situation is definitely difficult."
          },
          {
            "optionId": 1,
            "nextLineId": 8,
            "optionText": "She provided compelling evidence of corruption."
          },
          {
            "optionId": 2,
            "nextLineId": 9,
            "optionText": "She should have followed proper channels."
          }
        ]
      },
      {
        "lineId": 7,
        "lineText": "It is. And yet... The way she went about it - bypassing authorities, making these accusations public - it shows a lack of respect for our institutions, doesn't it? What do you think? There are proper channels for these concerns.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 10,
            "optionText": "Sometimes the proper channels don't work."
          },
          {
            "optionId": 1,
            "nextLineId": 11,
            "optionText": "You're right"
          },
          {
            "optionId": 2,
            "nextLineId": 12,
            "optionText": "It's complicated. Both sides have valid points."
          }
        ]
      },
      {
        "lineId": 8,
        "lineText": "Did she? Hmm. Even if that's true, going public instead of working through proper channels shows a lack of respect for authority, don't you think? There are established ways to address these issues.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 10,
            "optionText": "She tried the proper channels. They failed her."
          },
          {
            "optionId": 1,
            "nextLineId": 11,
            "optionText": "Authority should be respected, I agree."
          },
          {
            "optionId": 2,
            "nextLineId": 12,
            "optionText": "The truth is somewhere in the middle."
          }
        ]
      },
      {
        "lineId": 9,
        "lineText": "Exactly! I love our country, but we need order. Rules exist for a reason. Though between us, I do feel for her. Her son's situation... it's heartbreaking. But undermining our institutions isn't the answer, right?",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 13,
            "optionText": "Sometimes institutions need to be challenged."
          },
          {
            "optionId": 1,
            "nextLineId": 14,
            "optionText": "Stability matters most. I agree with you."
          },
          {
            "optionId": 2,
            "nextLineId": 15,
            "optionText": "I'm focusing on doing my job properly."
          }
        ]
      },
      {
        "lineId": 10,
        "lineText": "I heard a rumor that the Officer's brother-in-law is on the hospital board? Is it true? Hm, not a good look. But still, going public creates instability. Our nation has enough challenges already.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 16,
            "optionText": "Sometimes disruption is necessary for change."
          },
          {
            "optionId": 1,
            "nextLineId": 17,
            "optionText": "You're right about stability being important."
          }
        ]
      },
      {
        "lineId": 11,
        "lineText": "Glad you see it that way. A patriot respects the system, even when it's imperfect. Though I do hope her son gets the care he needs. It's a shame when personal tragedies get politicized like this.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 18,
            "optionText": "Is it political to want healthcare for your child?"
          },
          {
            "optionId": 1,
            "nextLineId": 19,
            "optionText": "Indeed. Personal matters shouldn't become public."
          }
        ]
      },
      {
        "lineId": 12,
        "lineText": "Always the diplomat! I suppose you're right. It's not black and white. But in uncertain times, don't we need to stay on the side of stability? Support our institutions rather than undermine them?",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 20,
            "optionText": "True stability comes from addressing problems."
          },
          {
            "optionId": 1,
            "nextLineId": 19,
            "optionText": "You're right. Stability must come first."
          }
        ]
      },
      {
        "lineId": 13,
        "lineText": "That's... a perspective. Between us, some say the Officer dismissed her complaints because of his hospital connections. But public accusations can damage our nation's reputation. Don't you think that matters?",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 21,
            "optionText": "Truth matters more than reputation."
          },
          {
            "optionId": 1,
            "nextLineId": 22,
            "optionText": "Both matter. It's about finding balance."
          }
        ]
      },
      {
        "lineId": 14,
        "lineText": "Exactly! We've worked too hard building this nation to let it be destabilized. The Officer will be pleased to know you're on the right side of this.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 23,
            "optionText": "I just want to do what's right."
          }
        ]
      },
      {
        "lineId": 15,
        "lineText": "Careful and professional. I respect that. Well, I should get back to work. Just wanted to check in. These... sensitive situations test all of us, don't they?",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 24,
            "optionText": "They certainly do."
          }
        ]
      },
      {
        "lineId": 16,
        "lineText": "That's... quite a progressive view. I should get back to work. Just be careful. People who push for disruption sometimes find themselves... disrupted. If you know what I mean.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 25,
            "optionText": "I understand the risks."
          }
        ]
      },
      {
        "lineId": 17,
        "lineText": "Good, good. I knew you'd understand. I should get back to work. The Officer mentioned your name the other day, you know. In a positive way. Keep making the right choices, and you'll do well here.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 23,
            "optionText": "Thank you for the advice."
          }
        ]
      },
      {
        "lineId": 18,
        "lineText": "Well, when you make it about systemic corruption rather than just getting help... Look, I'm just saying there are proper ways to handle these things. Ways that don't involve undermining our institutions.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 26,
            "optionText": "Maybe our institutions need some reform."
          },
          {
            "optionId": 1,
            "nextLineId": 23,
            "optionText": "I see your point about proper procedures."
          }
        ]
      },
      {
        "lineId": 19,
        "lineText": "Exactly! That's how a patriot thinks. Address problems quietly, through proper channels. Well, I should get back to work. Good talking with you!",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 23,
            "optionText": "Thank you, Abraham."
          }
        ]
      },
      {
        "lineId": 20,
        "lineText": "That's... an interesting perspective. I should get back to work. But be careful with such ideas. Not everyone here appreciates... reformist thinking.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 25,
            "optionText": "I'll keep that in mind."
          }
        ]
      },
      {
        "lineId": 21,
        "lineText": "That's... Be careful with that kind of talk. I admire your principles, but principle won't protect your position here. I should go.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "nextLineId": 25,
            "optionText": "I appreciate your concern."
          }
        ]
      },
      {
        "lineId": 22,
        "lineText": "A measured response. I respect that. Well, I should get back to work. But we should talk again soon.",
        "hasOptions": true,
        "options": [
          {
            "optionId": 0,
            "optionText": "Until next time, Abraham."
          }
        ]
      },
      {
        "lineId": 23,
        "lineText": "We'll speak again soon. It's good to know there are others who understand what truly matters for our country.",
        "hasOptions": false
      },
      {
        "lineId": 24,
        "lineText": "Good day to you!",
        "hasOptions": false
      },
      {
        "lineId": 25,
        "lineText": "Just... be careful. Not everyone appreciates those who rock the boat, even when the boat needs rocking.",
        "hasOptions": false
      },
      {
        "lineId": 26,
        "lineText": "Bold thoughts. Just remember, those who push hardest for change often face the strongest resistance. Take care of yourself.",
        "hasOptions": false
      }
    ]
  },
    {
      "dialogueId": 17,
      "dialogueName": "Friendly 2nd Dialogue with Tetiana after her 2nd article",
      "characterId": 2,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Hello! Thank you that you approved my last articles. It is very important for me.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 1,
              "optionText": "Hello Tetiana! I need to have serious talk with you."
            }
          ]
        },
        {
          "lineId": 1,
          "lineText": "Yes, I am listening.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 2,
              "optionText": "I reviewed it carefully. There were statistics, testimonies..."
            },
            {
              "optionId": 0,
              "nextLineId": 2,
              "optionText": "I reviewed it carefully. There were statistics, testimonies..."
            }
          ]
        }
      ]
    }
  ]
}
