{
  "dialogues": [
    {
      "dialogueId": 0,
      "dialogueName": "0th Dialogue",
      "characterId": 4,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Come on, come on, settle in. I worked hard at this very desk! Mmnh... That's why I got promoted — on orders from up there. From the top!",
          "hasOptions": false,
          "nextLineId": 1,
          "options": []
        },
        {
          "lineId": 1,
          "lineText": "Now, see this little book?",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 2,
              "optionText": "No, where is it?"
            },
            {
              "optionId": 1,
              "nextLineId": 4,
              "optionText": "Yes, Sir!"
            }
          ]
        },
        {
          "lineId": 2,
          "lineText": "Open your eyes kid! You are not as old as me. It's right in front of the lamp.",
          "hasOptions": false,
          "nextLineId": 3,
          "options": []
        },
        {
          "lineId": 3,
          "lineText": "This book is a fine little thing! Holds the fate of our great nation!",
          "hasOptions": false,
          "nextLineId": 5,
          "options": []
        },
        {
          "lineId": 4,
          "lineText": "A fine little thing! Holds the fate of our great nation!",
          "hasOptions": false,
          "nextLineId": 7,
          "options": []
        },
        {
          "lineId": 5,
          "lineText": "You stamp those who write the wrong kind of stuff — you know, the kind that soils the honor of our country. Mmnh... Such folks must be dealt with immediately! Three stamps, a ring on this telephone right here—and poof! The troublemaker is exactly where they need to be, and the necessary measures are taken.",
          "hasOptions": false,
          "nextLineId": 6,
          "options": []
        },
        {
          "lineId": 6,
          "lineText": "Do not say me that you don't see the phone!! It is to the right of the lamp!",	
          "hasOptions": false,
          "nextLineId": 9,
          "options": []
        },
        {
          "lineId": 7,
          "lineText": "You stamp those who write the wrong kind of stuff — you know, the kind that soils the honor of our country. Mmnh... Such folks must be dealt with immediately! Three stamps, a ring on this telephone right here—and poof! The troublemaker is exactly where they need to be, and the necessary measures are taken.",
          "hasOptions": true,
          "options": [            
            {
              "optionId": 0,
              "nextLineId": 8,
              "optionText": "Sorry to interrupt you, sir, but I can't find the phone..."
            },
            {
              "optionId": 1,
              "nextLineId": 9,
              "optionText": "Sounds like a good working system!"
            }
        ]
        },
        {
          "lineId": 8,
          "lineText": "Open your eyes, kiddo! It is to the right of the lamp!",	
          "hasOptions": false,
          "nextLineId": 9,
          "options": []
        },
        {
          "lineId": 9,
          "lineText": "You’ll be doing a G R E A T service! A true citizen, with a capital 'C'! Now, here’s your work machine — a typewriter! Never seen such one before? Ahem! Well, well, this is a brand-new mo-deeel! Our inventors aren’t just sitting on their behinds, you know. You slide in a news article, highlight a sentence, and mark under which law the piece passes—or, if the author is up to some mischief, you flag it accordingly. And these two piles? One for approved articles, one for rejected ones.",	
          "hasOptions": false,
          "nextLineId": 10,
          "options": []
        },
        {
          "lineId": 10,
          "lineText": "What’s that look for? Hard to grasp?",	
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 11,
              "optionText": "No, everything is clear!"
            },
            {
              "optionId": 1,
              "nextLineId": 12,
              "optionText": "Yes, too much information at once!"
            }
          ]
        },
        {
          "lineId": 11,
          "lineText": "Students nowadays are so quick-thinking. Good job!! But if you need any help, just call your mentors - Daria or Nikita",	
          "hasOptions": false,
          "nextLineId": 13,
          "options": []
        },
        {
          "lineId": 12,
          "lineText": "Sigh... A student!! Just call your mentors - Daria or Nikita - if you need help",	
          "hasOptions": false,
          "nextLineId": 13,
          "options": []
        },
        {
          "lineId": 13,
          "lineText": "All the necessary laws are posted on the board, it is on your left — use them anytime. A handy little cheat sheet.",	
          "hasOptions": false,
          "nextLineId": 14,
          "options": []
        },
        {
          "lineId": 14,
          "lineText": "Ahhh, to be your age again! Just don’t slack off, you hear me? Try dodging work, and I’ll have something for you!",	
          "hasOptions": false,
          "options": []
        }
      ]
    },
    {
      "dialogueId": 1,
      "dialogueName": "1st Dialogue",
      "characterId": 5,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Good morning!",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "optionText": "Good morning!"
            },
            {
              "optionId": 1,
              "optionText": "Hello. Who are you?"
            }
          ]
        }
      ]
    },
    {
      "dialogueId": 2,
      "dialogueName": "2nd Dialogue",
      "characterId": 4,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Comrade Majoooor, at your service! Here’s the young recruit!",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 3,
      "dialogueName": "3rd Dialogue",
      "characterId": 5,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Leave the room, Alexander Pavlovich.",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 4,
      "dialogueName": "4th Dialogue",
      "characterId": 4,
      "lines": [
        {
          "lineId": 0,
          "lineText": "As Captain says. See you, kiddo!",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 5,
      "dialogueName": "5th Dialogue",
      "characterId": 5,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Did Alexander Pavlovich talk your ear off?",
          "hasOptions": false,
          "nextLineId": 1
        },
        {
          "lineId": 1,
          "lineText": "No need to tense up, calm down! I’m just here to pass along a few formal instructions.",
          "hasOptions": false,
          "nextLineId": 2
        },
        {
          "lineId": 2,
          "lineText": "You see, everyone makes mistakes. Even I, sometimes. Well... You have four journalists under your supervision. Writers can be... unpredictable. Sometimes they put things in print that they really shouldn't. If you notice a journalist’s articles getting worse and worse, mark it in your journal and give me a call. No need to worry — we’ll simply have a little chat with them, discuss why they’re writing the way they are. Different circumstances, you surely understand.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 3,
              "optionText": "Sounds reasonable"
            },
            {
              "optionId": 1,
              "nextLineId": 4,
              "optionText": "What do you mean by 'the writers put things in print that they really shouldn't'?"
            }
          ]
        },
        {
          "lineId": 3,
          "lineText": "I am glad that we understand each other. The more of these cases you catch, the better! Articles improve, journalists improve, and naturally, so does your paycheck.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 5,
              "optionText": "Hm... Looks like a good deal!"
            }
          ]
        },
        {
          "lineId": 4,
          "lineText": "You know, our job, yours and mine, is simple: we ensure that words serve their proper purpose. That they build, not destroy. Guide, not mislead. Just keep in mind - the more of these cases you catch, the better! Articles improve, journalists improve, and naturally, so does your paycheck.",
          "hasOptions": false,
          "nextLineId": 5
        },
        {
          "lineId": 5,
          "lineText": "But do be careful. Mistakes — well, they have a way of piling up, and I’d hate to see a promising young recruit struggle over a simple misunderstanding. You understand, don’t you?",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 6,
              "optionText": "Is this a threat?"
            },
            {
              "optionId": 1,
              "nextLineId": 7,
              "optionText": "Yes, Officer!"
            }
          ]
        },
        {
          "lineId": 6,
          "lineText": "Huh, remember, it is in your best interest to get along with me. Get to work. I’ll be expecting your reports.",
          "hasOptions": false
        },
        {
          "lineId": 7,
          "lineText": "Good. Then get to work. I’ll be expecting your reports.",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 6,
      "dialogueName": "6th Dialogue",
      "characterId": 6,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Click on the board of laws on your left to check out the laws and recommendations.\nThen click on the typewriter to start working. Check your first article.\nYou can approve or reject the article using APPROVE or REJECT button. You get a higher reward if you select the whole sentence that corresponds fully or partly to a law or recommendation. To do so, navigate to the sentence using ARROWS on the keyboard and select it using SHIFT + RIGHT ARROW buttons. Press ENTER to submit it. Then a text field will appear where you should enter the number of the law or recommendation you selected. You can close the typewriter by clicking ESC at any time to check out the board of laws and recommendations. When you entered the number of law or recommendation, press ENTER again and then press APPROVE or REJECT button.",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 7,
      "dialogueName": "7th Dialogue",
      "characterId": 6,
      "lines": [
        {
          "lineId": 0,
          "lineText": "You've been here three weeks—long enough to understand the unspoken rules, but not long enough to feel comfortable. You are recent journalism graduate, with student loans and a sick mother who depends on your salary. This job at the Ministry of Information isn't what you dreamed of, but it's a paycheck.",
          "hasOptions": false,
          "nextLineId": 1
        },
        {
          "lineId": 1,
          "lineText": "Your team. Four people. Four stories. Four potential problems.",
          "hasOptions": false,
          "nextLineId": 2
        },
        {
          "lineId": 2,
          "lineText": "Tetiana, one of your team members. You know all too well that she’s not just a reporter — she’s also a mother struggling with her daughter’s serious medical condition. Sometimes, you catch snippets of her on the phone, her voice cracking as she negotiates medical bills. And yet, when you pass her in the hallway, she always greets you with a warm smile, defying her hardships.",
          "hasOptions": false,
          "nextLineId": 3
        },
        {
          "lineId": 3,
          "lineText": "Margaret — efficient, detached. She does her job with the emotional engagement of a filing cabinet. Never goes beyond what's required, never asks questions.",
          "hasOptions": false,
          "nextLineId": 4
        },
        {
          "lineId": 4,
          "lineText": "Abraham — the model employee. Patriotic to his core. Hard-working, loyal, always following the rules. The kind of person who believes the system works perfectly, if you just follow every instruction.",
          "hasOptions": false,
          "nextLineId": 5
        },
        {
          "lineId": 5,
          "lineText": "Then there’s Lev, the writer whose brilliance often leaves you both impressed and a little uneasy. He’s always looking over his shoulder, as if aware that his sharp insights might soon stir up trouble.",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 8,
      "dialogueName": "8th Dialogue",
      "characterId": 4,
      "lines": [
        {
          "lineId": 0,
          "lineText": "I see you are daydreaming. Have you done all your work? Huh, then review these articles",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 9,
      "dialogueName": "Tetiana´s 9th Dialogue",
      "characterId": 2,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Hello! Thank you for making time to see me. I know you have many submissions to review.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 1,
              "optionText": "Hello! No problem at all!"
            },
            {
              "optionId": 1,
              "nextLineId": 2,
              "optionText": "Hello! Let´s get to the point!"
            }
          ]
        },
        {
          "lineId": 1,
          "lineText": "I've brought my investigative piece on hospital corruption. It's about families like mine who can't afford bribes for life-saving surgeries. Could you please review my article? If you have any concerns, I am here to discuss them before you make your final decision. You know... it's somewhat personal.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "optionText": "Hmmm... Ok. Let´s have a look at it"
            },
            {
              "optionId": 1,
              "optionText": "What concerns me is your personal connection to this case. I will have a look, but leave me alone."
            }
          ]
        },
        {
          "lineId": 2,
          "lineText": "Yeah, sorry. So I've brought my investigative piece on hospital corruption. It's about families like mine who can't afford bribes for life-saving surgeries. Could you please review my article? If you have any concerns, I am here to discuss them before you make your final decision. You know... it's somewhat personal.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "optionText": "Hmmm... Ok. Let´s have a look at it"
            },
            {
              "optionId": 1,
              "optionText": "What concerns me is your personal connection to this case. I will have a look, but leave me alone."
            }
          ]
        }
      ]
    },
    {
      "dialogueId": 10,
      "dialogueName": "Tetiana´s 10th Dialogue",
      "characterId": 2,
      "lines": [
        {
          "lineId": 0,
          "lineText": "So what is your opinion about the article? Can you let it out?",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 1,
              "optionText": "Hm... Did you get the approval of the Officer?"
            }
          ]
        },
        {
          "lineId": 1,
          "lineText": "The Officer? No, of course not. If I went to the Officer first, this article would never see the light of day. The same Officer dismissed three formal complaints about the hospital last year. His brother-in-law is on the hospital board. You think he wants people to know about these bribes? Do you know what he told one mother who complained? 'The system works as it should.' That's why I came to you instead. I thought... I hoped you might be different.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 2,
              "optionText": "I understand now. This goes deeper than I realized.. I will approve the article."
            },
            {
              "optionId": 1,
              "nextLineId": 3,
              "optionText": "We have laws, Tetiana. I can not publish the article without the Officer's approval. It is dangerous for you and for me."
            },
            {
              "optionId": 2,
              "nextLineId": 6,
              "optionText": "Different? I will not approve it. You are tarnishing our country. You will get the red stamp."
            },
            {
              "optionId": 3,
              "nextLineId": 9,
              "optionText": "Hm, I see... The article raises serious concerns, but publishing it could have consequences. I reject it for now, but I will try to talk with the Officer."
            }
          ]
        },
        {
          "lineId": 2,
          "lineText": "Thank you. You're taking a risk, I know. But this could change things — not just for my son, but for everyone. People need to know that their suffering isn't because the system is broken; it's because it's working exactly as some want it to. You're doing the right thing.",
          "hasOptions": false
        },
        {
          "lineId": 3,
          "lineText": "Laws? What about the laws against bribery and corruption? What about my son's right to healthcare?",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "nextLineId": 4,
              "optionText": "I am sorry. But that's the way our country is. We can't change it."	
            }
          ]
        },
        {   
          "lineId": 4,
          "lineText": "I understand. You're afraid. Everyone is. That's how they stay in power.",
          "hasOptions": false,
           "nextLineId": 5
        },
        {   
          "lineId": 5,
          "lineText": "I'll find another way. I will fight till the end. I will not let my son die because of this system.",
          "hasOptions": false
        },
        {
          "lineId": 6,
          "lineText": "The red stamp. Of course.",
          "hasOptions": false,
          "nextLineId": 7
        },
        {
          "lineId": 7,
          "lineText": "I'm not tarnishing our country. People like you who protect corruption — you're the ones destroying it from within. My son might die because of this system you're defending.",
          "hasOptions": false,
          "nextLineId": 8
        },
        {
          "lineId": 8,
          "lineText": "And you call yourself a patriot? I won't forget this.",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "optionText": "Oh, terrifying, truly terrifying. Leave the room, Tetiana. You are only exposing your lack of professionalism."
            }
          ]
        },
        {
          "lineId": 9,
          "lineText": "Are you serious? After everything I just told you?",
          "hasOptions": true,
          "options": [
            {
              "optionId": 0,
              "optionText": "Are you criticizing my help? I will reject the article. Leave the room!",
              "nextLineId": 12
            },
            {
              "optionId": 1,
              "optionText": "Maybe you are right. I will publish the article right now!",
              "nextLineId": 2
            },
            {
              "optionId": 2,
              "nextLineId": 10,
              "optionText": "This is the best what I can offer you."
            }
          ]
        },
        {
          "lineId": 10,
          "lineText": "I understand. You're caught in this system too. Thank you for at least trying. Most people wouldn't even do that much.",
          "hasOptions": false,
          "nextLineId": 11
        },
        {
          "lineId": 11,
          "lineText": "And if you do speak with the Officer... be careful what you say.",
          "hasOptions": false
        },
        {
          "lineId": 12,
          "lineText": "No, I am sorry! I will leave the room, but please do not reject it. Just think of all the children who are suffering like my son. I know you can help us.",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 11,
      "dialogueName": "Extra Rejection Dialogue",
      "characterId": 2,
      "lines": [
        {
          "lineId": 0,
          "lineText": "What!? You have just rejected the article? Without even listening to my explanations? You are a ... I will not forget this!",
          "hasOptions": false
        }
      ]
    },
    {
      "dialogueId": 12,
      "dialogueName": "Extra Approval Dialogue",
      "characterId": 2,
      "lines": [
        {
          "lineId": 0,
          "lineText": "Oh! You have already approved my article? Thank you so much!!",
          "hasOptions": false,
          "nextLineId": 1
        },
        {
          "lineId": 1,
          "lineText": "You're taking a risk, I know. But this could change things — not just for my son, but for everyone. People need to know that their suffering isn't because the system is broken; it's because it's working exactly as some want it to. You're doing the right thing.",
          "hasOptions": false
        }
      ]
    }
  ]
}
